# Скорость первого автомобиля V1 км/ч, второго — V2 км/ч,
# расстояние между ними S км. Определить расстояние между ними через T часов,
# если автомобили удаляются друг от друга. Данное расстояние равно сумме начального
# расстояния и общего пути, проделанного автомобилями; общий путь = время · суммарная скорость.

V1 = int(input('введите скорость первого автомобиля'))
V2 = int(input('введите скорость второго автомобиля'))
S1 = int(input('введите расстояние между ними'))
T = int(input('введите время'))

S2 = T * V1 + V2 - S1

print(f'Расстояние между автомобилями через {T} часов: {S2} км')