# Скорость лодки в стоячей воде V км/ч, скорость течения реки U км/ч (U < V).
# Время движения лодки по озеру T1 ч, а по реке против течения — T2 ч.
# Определить путь S, пройденный лодкой. Учесть, что при движении против
# течения скорость лодки уменьшается на величину скорости течения.

V = int(input('Введите скорость лодки в стоячей воде'))
U = int(input('Введите скорость течения реки'))
T1 = int(input('Введите время движения лодки по озеру'))
T2 = int(input('Введите время движения лодки против течения реки'))

S = (V * T1) + ((V - U) * T2)

print(f'Путь, пройденный лодкой: {S} км')