# Известно, что X кг шоколадных конфет стоит A рублей,
# а Y кг ирисок стоит B рублей. Определить, сколько стоит 1 кг шоколадных конфет,
# 1 кг ирисок, а также во сколько раз шоколадные конфеты дороже ирисок.

X = float(input('введите массу шоколадных конфет'))
A = float(input('введите стоимость этих шоколадных конфет'))
Y = float(input('введите массу ирисок'))
B = float(input('введите стоимость этих ирисок'))

sum = A / X * 1
sum2 = B / Y * 1
dif = sum / sum2

print(f'Стоимость 1 кг шоколадных конфет: {sum}')
print(f'Стоимость 1 кг ирисок: {sum2}')
print(f'Шоколадные конфеты дороже ирисок в {dif} раз')