# Даны два целых числа A и B (A < B).
# Вывести в порядке возрастания все целые числа, расположенные между A и B
# (включая сами числа A и B), а также количество N этих чисел.

A = int(input('Введите первое целое число'))
B = int(input('Введите второе число (оно должно быть больше первого)'))

if A > B or A == B:
    print('Ошибка: второе число должно быть больше первого')
elif A < B:
    for num in range(A, B + 1):
        print(num, end=" ")
    print()  # переход на новую строку после вывода всех чисел

# Подсчёт и вывод количества чисел
N = B - A + 1
print(f"Количество чисел: {N}")